In [2]:
import pandas as pd

In [3]:
data = {'Team name': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings'],
        'team Rank': [1, 2, 2, 5, 3],
        'Year': [2014,2015,2014,2015,2014],
       'team Points':[876,789,863,673,741]}
df = pd.DataFrame(data)
df

  Team name  team Rank  Year  team Points
0    Riders          1  2014          876
1    Riders          2  2015          789
2    Devils          2  2014          863
3    Devils          5  2015          673
4     Kings          3  2014          741

In [4]:
df.rename(columns={'Team name':'Team Name'}, inplace = True)

In [5]:
df

  Team Name  team Rank  Year  team Points
0    Riders          1  2014          876
1    Riders          2  2015          789
2    Devils          2  2014          863
3    Devils          5  2015          673
4     Kings          3  2014          741

In [6]:
df.rename(columns={'Team Name':'Team_Name', 'team Rank':'Team Rank'}, inplace = True)

In [7]:
#to get all columns name of dataset
df.columns

Index(['Team_Name', 'Team Rank', 'Year', 'team Points'], dtype='object')

In [8]:
#to replace all columns where blank space is there with '_'
df.columns = df.columns.str.replace(' ','_')

In [9]:
df.columns

Index(['Team_Name', 'Team_Rank', 'Year', 'team_Points'], dtype='object')

In [10]:
df

  Team_Name  Team_Rank  Year  team_Points
0    Riders          1  2014          876
1    Riders          2  2015          789
2    Devils          2  2014          863
3    Devils          5  2015          673
4     Kings          3  2014          741

In [13]:
df.rename(columns={'Team_Name':'Team Name'}, inplace=True)

In [14]:
df

  Team Name  Team_Rank  Year  team_Points
0    Riders          1  2014          876
1    Riders          2  2015          789
2    Devils          2  2014          863
3    Devils          5  2015          673
4     Kings          3  2014          741